{"id":415853,"xmlId":"com.jetbrains.space","name":"Space","description":"\n    \n            <b>JetBrains Space:</b> A complete platform for software development, collaboration, and team and project management.<br><br>\n            Host Git repositories, review code, automate your CI/CD, store and publish packages, manage issues and documents, and communicate with your team in chats.<br><br>\n            <a href=\"https://www.jetbrains.com/space/?utm_source=product&amp;utm_medium=link&amp;utm_campaign=IU&amp;utm_content=13362-space&amp;utm_term=description\">Explore Space and sign up for free</a><br><br>\n            Connect your IDE to your organization in Space. This allows you to clone and share Git repositories, perform code reviews with merge requests, edit Automation scripts with Kotlin plugin support, track an automation job’s progress, and more.\n            \n  \n<h2>Getting started</h2>\n<p>Space plugin is intended for JetBrains Space members that use IntelliJ-based IDEs to work on their projects. It links your IDE with your organization at JetBrains Space and lets you view and clone project repositories and navigate to Space features right from the IDE.</p>\n\n<p>Space plugin works across all JetBrains IDEs of the latest version (2019.3+). The Space plugin is bundled in <a href=\"https://www.jetbrains.com/idea/\">IntelliJ IDEA</a> starting from version 2021.1 and <a href=\"https://www.jetbrains.com/pycharm/\">PyCharm</a> from version 2021.2. You can install the plugin manually in our other IntelliJ-based IDEs.\n</p>\n\n<h3>Log in to Space</h3>\n\n<p>Before you can start using Space plugin, you need to provide it with your Space organization address and log in to Space.</p>\n\n<ol>\n<li>In your IDE, go to <strong>Tools</strong> &gt; <strong>Space</strong> &gt; <strong>Log in to Space</strong></li>\n\n<li>Enter the address of your Space organization website, e.g <em>https://mycompany.jetbrains.space</em>\n(Make sure to enter the full URL starting with <em>https://</em>)</li>\n</ol>\n\n<p>The Space login screen will open in a browser where you can enter your Space credentials.  If you're successfully logged in, your Space avatar will be displayed in the IDE.</p>\n\n<h3>View and clone repositories</h3>\n\n<p>View all projects and repositories hosted in your Space organization then clone a repository you want to contribute to.</p>\n\n<ol>\n<li>In your IDE, go to <strong>Tools</strong> &gt; <strong>Space</strong> &gt; <strong>Clone Repository</strong>.  A list of projects and repositories will be displayed.</li>\n\n<li>To clone a repository to your machine, select it from the list and click <strong>OK</strong>.</li>\n</ol>\n\n<h3>Navigate to Space features</h3>\n\n<p>Quickly navigate to the issues, checklists, or code reviews associated with the project you're currently working on in your IDE.</p>\n\n<ol>\n<li>In your IDE, go to <strong>Tools</strong> &gt; <strong>Space</strong></li>\n\n<li>Choose what you'd like to see:</li>\n</ol>\n\n<ul>\n<li><strong>Code Reviews</strong></li>\n\n<li><strong>Checklists</strong></li>\n\n<li>or <strong>Issues</strong></li>\n</ul>\n\n<p>The Code Reviews will open right in your IDE, the Checklists and Issues will open in your browser.</p>\n\n\n<br>\n<p>When viewing a commit log in your IDE, instantly open a commit in Space to comment on it, start a code review, or contact the author.</p>\n\n<ol>\n<li>In your IDE's <strong>Version Control</strong> tool window open the <strong>Log</strong> tab.</li>\n\n<li>Right-click a commit and choose <strong>Open in Space</strong>.</li>\n</ol>\n\n<p>The selected commit will open in your browser.</p>","organization":"JetBrains s.r.o.","tags":["Tools Integration"],"vendor":"JetBrains","version":"232.10072.29","notes":"\n  \n    <h1>What's new in 2023.2</h1>\n\n    <ul>\n      <li>\n        We updated the layout of the Details panel to give you a unified view of the changes contained in each code review or merge request.\n        This makes the experience more consistent with code review support in other VCS plugins like GitHub and GitLab.\n      </li>\n      <li>\n        We also fixed various problems with text widths and layout to make sure you have a comfortable reading experience when reviewing\n        code.\n      </li>\n    </ul>\n    \n  ","optionalDependencies":["com.intellij.modules.vcs","Git4Idea","intellij.space.kotlin.scripting","intellij.space.vcs","org.jetbrains.kotlin","intellij.indexing.shared","com.intellij.java","com.jetbrains.php","com.jetbrains.gateway"],"since":"232.10072","until":"232.*","size":22469007}